{
  "recipes": [
    {
      "id": 1,
      "name": "5 Bean Chilli Stew",
      "by": "kira",
      "time":"25",
      "img": "https://media.istockphoto.com/id/1454643569/photo/italian-beef-vegetable-stew.webp?b=1&s=170667a&w=0&k=20&c=Q3e67mC-rHcbK_dJGebhclYop5RKETOSqbmlGQxWP0E=",
      "ingredients": [
        "1½ tbsp rapeseed oil",
        "1 onion, sliced",
        "2 peppers, sliced",
        "2 garlic cloves, crushed",
        "1 tbsp ground cumin",
        "2 tsp hot smoked paprika",
        "400g can chopped tomatoes",
        "400g can mixed beans, drained",
        "400g can black beans, drained",
        "pinch of sugar",
        "250g brown rice",
        "½ small bunch coriander, chopped"
      ],
      "instructions": [
        "Heat the oil in a casserole dish and fry the onion and peppers for 10 mins over a medium heat until the onion is golden brown. Add the garlic and spices, and fry for 1 min. Pour in the tomatoes, both cans of beans, 50ml water, then add the sugar and season. Simmer, stirring regularly, for 15-20 mins until thickened.",
        "Meanwhile, cook the rice following pack instructions. Serve the chilli on the rice and scatter over the coriander. Top with a spoonful of soured cream, or guacamole, if you like."
      ]
    },
    {
      "id": 2,
      "name": "Veg Noodles",
      "by": "sura",
      "time":"25",
      "img": "https://images.unsplash.com/photo-1620147123631-7291b2b5a4f7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8dmVnJTIwbm9vZGxlc3xlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=500&q=60",
      "ingredients": [
        "200 grams noodles, whole wheat or plain flour",
        "5 cups water",
        "½ teaspoon oil",
        "½ teaspoon salt",
        "1 cup shredded cabbage",
        "½ cup shredded carrots or 1 medium to large carrot",
        "½ cup shredded carrots or 1 medium to large carrot",
        "8 to 10 french beans, thinly sliced diagonally or finely chopped",
        "⅓ cup sliced capsicum (green bell pepper) or 1 small to medium-sized",
        "1 teaspoon finely chopped garlic or 3 to 4 small to medium-sized",
        "1 teaspoon finely chopped ginger or 1 inch ginger",
        "1 to 2 tablespoon soy sauce or as required",
        "1 to 2 teaspoons finely chopped celery or 1 teaspoon chopped coriander leaves, optional",
        "2 to 3 tablespoons toasted sesame oil – can use sunflower oil or any neutral oil",
        "salt as required",
        "crushed black pepper as required",
        "1 teaspoon rice vinegar or mirin or white vinegar"
      ],
      "instructions": [
        "First boil water in a pan with salt and oil.",
        "Add noodles to the boiling water and cook them till they are just cooked or al dente.",
        "While noodles are cooking, rinse and chop the vegetables.",
        "Once noodles are cooked al dente, drain them in a colander or sieve.",
        "Then rinse noodles in fresh water by placing the colander or sieve under fresh tap water.",
        "Drain all the water and set aside.",
        "Heat oil in a wok or pan.",
        "First add the garlic and ginger and stir fry or sauté on low to medium-low heat for some seconds.",
        "Increase the heat to a high and add the chopped spring onions.",
        "Keep on stirring continuously and stir fry the onions till they become translucent.",
        "Add the veggies - carrots, capsicum and french beans.",
        "Continue to toss and stir fry on a high flame till the veggies are almost cooked.",
        "Use a pan with handles as its better to lift it while tossing.",
        "You can also decrease the flame if the heat becomes too much too handle and then stir fry the veggies on a medium flame.",
        "Some crunch should be there in the vegetables, so don’t cook the vegetables till they become completely soft.",
        "Add the soy sauce, celery, salt and pepper. Mix well.",
        "Add cooked noodles. Keep on tossing and stirring till the veggies are mixed well with noodles for a minute or two. Switch off the heat.",
        "Check the taste and add more salt, black pepper or soy sauce if required to the stir-fried veg noodles."
      ]
    },
    {
        "id": 3,
        "name":"Tofu Curry",
        "by": "dave",
        "img": "https://images.unsplash.com/photo-1588166524941-3bf61a9c41db?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8dG9mdSUyMGN1cnJ5fGVufDB8fDB8fHww&auto=format&fit=crop&w=500&q=60",
        "time" :"25",
        "ingredients":[
            "Tofu",
            "Soy Sauce",
            "Ginger",
            "Tomato Paste",
            "Spices",
            "Diced Tomatoes",
            "Greek Yogurt",
            "Frozen Green Peas"
        ],
        "instructions":[
            "Sauté the tofu in spices until crispy. Move to a plate.",
            "Sauté the onion.",
            "Add the spices and cook until very fragrant.",
            "Add the veggie and remaining ingredients. Let the tofu curry simmer for 10 minutes, until thickened. Stir in the tofu and peas."
        ]

    }
  ]
}
